Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходныйКассовыйОрдер</Name>
		</Properties>
	</Document>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБрони</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/РасходныйКассовыйОрдер/Forms/ФормаДокументаОднострочная/Ext/Form/Module.bsl
//ПолучитьВариантыНомера(СтрокаПоиска)
//на основании присланной строки поиска, получает возможные варианты номеров заявки
&НаСервере
Функция ПолучитьВариантыНомера(СтрокаПоиска)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьВариантыНомера(СтрокаПоиска);
КонецФункции

//ПолучитьМассивЗаявок(Параметры)
//на основании присланной структуры параметров СБ, возвращает массив документов с заявками из той же СБ
&НаСервере
Функция ПолучитьМассивЗаявок(Параметры)
	Возврат ЭТ_ОбщийМодуль2.RequestSearch(Параметры);	
КонецФункции

//ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
//получает настройку пользователя по присланному коду
&НаСервере
Функция ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку(Ключ,ПоУмолчанию);	
КонецФункции

//ПолучитьКонтрагентаПоДоговору(Договор)
//возвращает контрагента по договору
&НаСервере
Функция ПолучитьКонтрагентаПоДоговору(Договор)
	Возврат Договор.Владелец;
КонецФункции

//НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
//по присланному номеру заявки выполняет поиск договора покупателя в 1С
&НаСервере
Функция НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
	ВидДоговораКлиент = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораКлиент");
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование 
		|ИЗ 
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Номер = &НомерДоговора
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора 
		|	И Не ПометкаУдаления		
		|"); 
	Запрос.УстановитьПараметр("НомерДоговора", НомерЗаявки);	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговораКлиент);		
	Результат = Запрос.Выполнить().Выбрать(); 
	Пока Результат.Следующий() Цикл 		
		Возврат Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Возврат ПоУмолчанию;
КонецФункции

//ПолучитьДанныеЗаявки(СледЗаявкаНомер)
//по присланному коду заявки в СБ возвращает структуру данных заявки из СБ
&НаСервере
Функция ПолучитьДанныеЗаявки(СледЗаявкаНомер)
	Возврат ЭТ_ОбщийМодуль2.Request(Новый Структура("id",СледЗаявкаНомер));
КонецФункции

//ЗаполнитьФормуПКО(Парам)
//на основании присланных данных заполняет данные формы
&НаСервере
Процедура ЗаполнитьФормуРКО(Парам)
	Объект.Контрагент = Парам.Контрагент;
	ЭтаФорма.РасшифровкаПлатежаДоговорКонтрагента = Парам.РасшифровкаПлатежаДоговорКонтрагента;
	Объект.Контрагент =  Парам.Контрагент;
	Объект.Основание = "Возврат по договору "+СокрЛП(ЭТ_ОбщийМодуль2.УдалитьДатуИзСтроки(Парам.РасшифровкаПлатежаДоговорКонтрагента));
	Объект.Комментарий =  "Возврат по договору "+СокрЛП(ЭТ_ОбщийМодуль2.УдалитьДатуИзСтроки(Парам.РасшифровкаПлатежаДоговорКонтрагента));
КонецПроцедуры


&НаКлиенте
Процедура ЭТ_ЗаполнитьСБВместо(Команда)
	ТекущийПрефикс = ПолучитьНастройку("Префикс");
	Объект.Организация = ПолучитьНастройку("Организация");
	МассивНомеров = Новый Массив;
	Для Каждого ВариантНомера Из ПолучитьВариантыНомера(ЭтаФорма.СтрокаПоиска) Цикл
		Парам = Новый Структура;
		Парам.Вставить("r_id_internal",ВариантНомера);	
		МассивДанных = ПолучитьМассивЗаявок(Парам);
		Если МассивДанных.Количество()>0 Тогда		
			Для Каждого СледЭлемент Из МассивДанных Цикл
				МассивНомеров.Добавить(СледЭлемент.id);
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	Для Каждого СледЗаявкаНомер Из ЭТ_ОбщийМодуль2.УдалитьДублиИзМассива(МассивНомеров) Цикл
		ДанныеЗаявки = 	ПолучитьДанныеЗаявки(СледЗаявкаНомер);
		Если ДанныеЗаявки.Количество()>0 Тогда
			Для Каждого СледЗаявка Из ДанныеЗаявки Цикл
				//Проверяем наличие договора
				Если СледЗаявка.Свойство("id_internal") Тогда
					НайденДоговор = НайтиДоговорПокупателя(СледЗаявка.id_internal,Ложь);
					Если НЕ НайденДоговор = Ложь Тогда
						Контрагент = ПолучитьКонтрагентаПоДоговору(НайденДоговор);
						РасшифровкаПлатежаДоговорКонтрагента=НайденДоговор;
					КонецЕсли;
					ЗаполнитьФормуРКО(Новый Структура("Контрагент, РасшифровкаПлатежаДоговорКонтрагента",Контрагент, РасшифровкаПлатежаДоговорКонтрагента));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = Ложь;
	ТекущийЭлемент = ЭтаФорма.Элементы.СуммаДокумента;
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_ОткрытьПоискСБВместо(Команда)
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = НЕ ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость;
КонецПроцедуры
